"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/

const num = +prompt(`Введите число`);
const calculateSalary = (num) => num * 0.87;


if (Number.isNaN(num)) {
  console.log("Значение задано неверно");
} else {
  //const numFloat = parseFloat(num);
  console.log(`Средства к выдаче: ${calculateSalary(num)}`);
}



